In [2]:
import pandas as pd
import numpy as np
df=pd.DataFrame({"col":[1,2,3,np.nan],"col2":[444,555,666,444],"col3":["M","m","F","f"]})
df.head()

   col  col2 col3
0  1.0   444    M
1  2.0   555    m
2  3.0   666    F
3  NaN   444    f

In [3]:
df.isnull().sum()

col     1
col2    0
col3    0
dtype: int64

In [4]:
#dropna
df.dropna(thresh=2)

   col  col2 col3
0  1.0   444    M
1  2.0   555    m
2  3.0   666    F
3  NaN   444    f

In [14]:
#fillna()
df.fillna(4.0)

   col  col2 col3
0  1.0   444    M
1  2.0   555    m
2  3.0   666    F
3  4.0   444    f

In [18]:
#unique
df['col'].unique()

array([ 1.,  2.,  3., nan])

In [19]:
#nunique
df['col2'].nunique()

3

In [20]:
#value_counts
df['col3'].value_counts()

col3
M    1
m    1
F    1
f    1
Name: count, dtype: int64

In [24]:
#selecting data
ndf=df[df['col']>2 & (df['col2']==666)]

In [25]:
ndf

   col  col2 col3
0  1.0   444    M
1  2.0   555    m
2  3.0   666    F

In [26]:
#sum
df['col2'].sum()

2109

In [28]:
#sort_values
df['col'].sort_values()

0    1.0
1    2.0
2    3.0
3    NaN
Name: col, dtype: float64